Added UML Class Diagram to the README
